import React from 'react'
import { Card, CardContent, Grid, Typography } from '@material-ui/core'

const Instructions = () => {
  return (
    <>
    <div className='mt-5 pt-3'>
   <Typography gutterBottom variant="h5" align="center">
      ইসলামে বিয়ের গুরুত্ব
       </Typography>
      <Grid>
        <Card elevation='disabled' style={{ maxWidth: 600, padding: "20px 0px", margin: "0 auto" }}>
          <CardContent>
              <ul>
                
                  <Typography gutterBottom variant="body3">
                  তিনজন ব্যক্তি আল্লাহ রাসুল (সা.)-এর ঘরে আসলেন। তারা ঘরবাসীদের রাসুল (সা.)-এর ইবাদত সম্পর্কে জিজ্ঞেস করেন। তার ইবাদতের কথা শুনে তারা যেন বলল, কোথায় আল্লাহ রাসুল (সা.) আর কোথায় আমরা? তার আগের ও পরের সব গুনাহ ক্ষমা করে দেয়া হয়েছে। তখন তাদের একজন বলল, আমি সারাজীবন রাতভর ইবাদত করব। আরেকজন বলল, আমি আজীবন রোজা রাখব। কখনো রোজা ভাঙব না। অন্যজন বলল, আমি নারীদের থেকে দূরে থাকব; কখনো বিয়ে করব না। আল্লাহর রাসুল তখন (সা.) তাদের কাছে এসে বললেন, ‘আরে! তোমরা এমন-অমন বলছো না! অথচ আমি তোমাদের সবার চেয়ে বেশি আল্লাহকে ভয় করি। কিন্তু আমি রোজা রাখি, আবার ইফতারও করি। নামাজ পড়ি, আবার ঘুমও যাই। নারীকে বিয়েও করি করি। অতএব, যারা আমার সুন্নত ছেড়ে দেবে, তারা আমার উম্মতের অন্তর্ভুক্ত নয়।’ (বুখারি, হাদিস : ৫০৬৩; মুসলিম, হাদিস : ১৪০১) <br/><br/>
                 </Typography> 
                  
                 
                  
                
                  <Typography gutterBottom variant="body3">
                  আল্লাহর রাসুল (সা.) আরো বলেন, ‘হে যুব সম্প্রদায়! তোমাদের মধ্যে যে বিয়ের সামর্থ্য রাখে, সে যেন বিয়ে করে নেয়, কেননা তা চক্ষুকে সংযত রাখে এবং লজ্জাস্থান রক্ষা করে। (বুখারি, হাদিস : ৫০৬৬; মুসলিম, হাদিস : ১৪০০) <br/><br/>
                 </Typography> 
                  
                
                  <Typography gutterBottom variant="body3">
                  রাসুল (সা.) আরো বলেন, ‘যখন বান্দা বিয়ে করে, তখন সে তার দ্বীনের অর্ধেক পূরণ করে। অতএব, বাকি অর্ধেকাংশে সে যেন আল্লাহকে ভয় করে।’ (সহিহ আল-জামিউস সাগির ওয়া জিয়াদাতুহু, হাদিস : ৬১৪৮; তাবরানি, হাদিস : ৯৭২; মুসতাদরাক হাকিম, হাদিস : ২৭২৮) <br/><br/>
                 </Typography> 
                  
                
                  <Typography gutterBottom variant="body3">
                  আবু হুরাইরা (রা.) থেকে বর্ণিত এক হাদিসে আছে, তিনি বলেন- আল্লাহর রাসুল (সা.) বলেছেন, ‘তিন প্রকারের মানুষকে সাহায্য করা আল্লাহ তাআলা নিজের কর্তব্য হিসেবে নির্ধারণ করেছেন। এক. আল্লাহ তাআলার পথে জিহাদকারী। দুই. মুকাতাব গোলাম- যে চুক্তির অর্থ পরিশোধের ইচ্ছা করে। তিন. বিয়ে আগ্রহী- যে পবিত্র জীবন যাপন করতে চায়। (ইবনে মাজাহ, হাদিস : ২৫১৮) <br/><br/>
                 </Typography> 
                  
                  

              </ul>
           
            
           
          </CardContent>
        </Card>
        </Grid>
   <Typography gutterBottom variant="h5" align="center">
      জীবনসঙ্গী নির্বাচনে ইসলামের নির্দেশনা
       </Typography>
      <Grid>
        <Card elevation='disabled' style={{ maxWidth: 600, padding: "20px 0px", margin: "0 auto" }}>
          <CardContent>
              <ul>
                
                  <Typography gutterBottom variant="body3">
                  “তোমরা নারীদের (কেবল) রূপ দেখে বিবাহ করো না। হতে পারে রূপই তাদের বরবাদ করে দেবে। তাদের অর্থ-সম্পদ দেখেও বিবাহ করো না, হতে পারে অর্থ-সম্পদ তাকে উদ্ধত করে তুলবে। বরং দ্বীন দেখেই তাদের বিবাহ কর। একজন নাক-কান-কাটা অসুন্দর দাসীও (রূপসী ধনবতী স্বাধীন নারী অপেক্ষা) শ্রেয়, যদি সে দ্বীনদার হয়। “(ইবনে মাজাহ) <br/><br/>
                 </Typography> 
                  
                 
                  
                
                  <Typography gutterBottom variant="body3">
                  “সমগ্র দুনিয়াটাই সম্পদ। এর মধ্যে সবচাইতে উত্তম সম্পদ হলাে পরহেযগার স্ত্রী। “(মুসলিম – ৩৭১৬) <br/><br/>
                 </Typography> 
                  
                
                  <Typography gutterBottom variant="body3">
                  ‘যার দ্বীনদারীতা ও চরিত্রে তোমরা সন্তুষ্ট, এমন কেউ বিবাহের প্রস্তাব দিলে তার সাথে তোমরা বিবাহ সম্পন্ন কর। তা না করলে পৃথিবীতে ফিৎনা দেখা দেবে ও ব্যাপক ফাসাদ ছড়িয়ে পড়বে।’ (তিরমিযী: ১০৮৪) <br/><br/>
                 </Typography> 
                  
                
                  <Typography gutterBottom variant="body3">
                  ‘নারীকে বিবাহ করা হয় চারটি জিনিস দেখে। তার সম্পদ দেখে, বংশমর্যাদা দেখে, রূপ দেখে এবং দ্বীনদারী দেখে। হে মুমিন! তুমি দ্বীনদার নারী বিবাহ করে ধন্য হয়ে যাও।’ (বুখারী : ৫০৯০ ) <br/><br/>
                 </Typography> 
                  
                  <Typography gutterBottom variant="body3">
                  ‘তোমরা বিয়ে করো অতি সোহাগিনী ও অধিক সন্তান প্রসবিনী নারীকে। কেননা আমি তোমাদের সংখ্যাধিক্যের দ্বারা অন্যান্য উম্মতের ওপর গর্ব করব।' (আবু দাউদ) <br/><br/>
                 </Typography> 
                 
                  <Typography gutterBottom variant="body3">
                  হযরত আবু হুরায়রা রা. হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করা হল, নারীদের মধ্যে কোন নারী উত্তম। তিনি বললেন, স্বামী যাকে দেখলে আনন্দবোধ করে, যাকে আদেশ করলে আনুগত্য করে, স্ত্রীর বিষয়ে এবং সম্পদের ব্যাপারে স্বামী যা অপছন্দ করে তা থেকে বিরত থাকে।-মুসনাদে আহমদ, হাদীস : ৭৪২১; সুনানে নাসায়ী, কুবরা, হাদীস : ৮৯৬১ <br/><br/>
                 </Typography> 
                  

              </ul>
           
            
           
          </CardContent>
        </Card>
        </Grid>
        </div>
    </>
  )
}

export default Instructions