const pdivisionsData = [
    {
      pname: "চট্টগ্রাম",
      pdistricts: [
        {
        pdname:"কুমিল্লা",
        pupazilas:[
        "দেবিদ্বার","বরুড়া","ব্রাহ্মণপাড়া","চান্দিনা","চৌদ্দগ্রাম",
        "দাউদকান্দি","হোমনা","লাকসাম","মুরাদনগর","নাঙ্গলকোট",
        "কুমিল্লা সদর","মেঘনা","মনোহরগঞ্জ","সদর দক্ষিণ","তিতাস","বুড়িচং","লালমাই",
        ]},
        {pdname:"ফেনী",
        pupazilas:[
          "ছাগলনাইয়া উপজেলা","ফেনী সদর","সোনাগাজী উপজেলা","ফুলগাজী উপজেলা","পরশুরাম",
          "দাগনভূঞা",
        ]}, 
        {pdname:"ব্রাহ্মণবাড়িয়া	", 
        pupazilas:[
          "ব্রাহ্মণবাড়িয়া সদর","কসবা","নাসিরনগর","সরাইল উপজেলা","আশুগঞ্জ",
          "আখাউড়া","নবীনগর","বাঞ্ছারামপুর","বিজয়নগর",
        ]},
        {pdname:"রাঙ্গামাটি	",
        pupazilas:[
          "রাঙ্গামাটি সদর","কাপ্তাই","কাউখালী","বাঘাইছড়ি","বরকল",
        "লংগদু","রাজস্থলী","বিলাইছড়ি","জুরাছড়ি","নানিয়ারচর",
       
        ]},
        {pdname:"নোয়াখালী",
        pupazilas:[
          "নোয়াখালী","কোম্পানীগঞ্জ","বেগমগঞ্জ","হাতিয়া","সুবর্ণচর",
        "কবিরহাট","সেনবাগ","চাটখিল","সোনাইমুড়ী",
        ]},
        {pdname:"চাঁদপুর",
        pupazilas:[
          "হাইমচর","কচুয়া","শাহরাস্তি","চাঁদপুর সদর","মতলব উত্তর",
          "হাজীগঞ্জ","মতলব দক্ষিণ","ফরিদগঞ্জ",
        ]},
        {pdname:"লক্ষ্মীপুর",
        pupazilas:[
          "লক্ষ্মীপুর সদর","কমলনগর","রায়পুর","রামগতি","রামগঞ্জ",
         
        ]},
        {pdname:"চট্টগ্রাম",
        pupazilas:[
          "রাঙ্গুনিয়া","সীতাকুন্ড উপজেলা","মীরসরাই","পটিয়া","সন্দ্বীপ",
        "বাঁশখালী","বোয়ালখালী","আনোয়ারা","চন্দনাইশ","সাতকানিয়া",
        "লোহাগাড়া","হাটহাজারী","ফটিকছড়ি","রাউজান","কর্ণফুলী",
        ]},
        {pdname:"কক্সবাজার",
        pupazilas:[
          "কক্সবাজার সদর","চকরিয়া","কুতুবদিয়া","উখিয়া","মহেশখালী",
          "পেকুয়া","রামু","টেকনাফ",
        ]},
        {pdname:"খাগড়াছড়ি",
        pupazilas:[
          "খাগড়াছড়ি সদর","দিঘীনালা","পানছড়ি","লক্ষীছড়ি","মহালছড়ি",
          "মানিকছড়ি","রামগড়","মাটিরাঙ্গা","গুইমারা",
        ]},
        {pdname:"বান্দরবান",
        pupazilas:[
          "বান্দরবান সদর","আলীকদম","নাইক্ষ্যংছড়ি","রোয়াংছড়ি","লামা",
          "রুমা","থানচি",
        ]},
      ]
    },
    {
      pname: "রাজশাহী",
      pdistricts: [
        {
        pdname:"সিরাজগঞ্জ",
        pupazilas:[
        "বেলকুচি","চৌহালি","কামারখন্দ","কাজীপুর","রায়গঞ্জ",
        "শাহজাদপুর","সিরাজগঞ্জ","তাড়াশ","উল্লাপাড়া",
        ]},
        {pdname:"পাবনা",
        pupazilas:[
          "সুজানগর","ঈশ্বরদী","ভাঙ্গুড়া","পাবনা সদর","বেড়া",
          "আটঘরিয়া","চাটমোহর","সাঁথিয়া","ফরিদপুর",
        ]}, 
        {pdname:"বগুড়া", 
        pupazilas:[
          "কাহালু উপজেলা","বগুড়া সদর","সারিয়াকান্দি","শাজাহানপুর","দুপচাচিঁয়া উপজেলা",
          "আদমদিঘি উপজেলা","নন্দিগ্রাম","সোনাতলা উপজেলা","ধুনট উপজেলা","গাবতলী",
          "শেরপুর উপজেলা","শিবগঞ্জ",
        ]},
        {pdname:"রাজশাহী",
        pupazilas:[
          "পবা উপজেলা","দুর্গাপুর উপজেলা","মোহনপুর উপজেলা","চারঘাট উপজেলা","পুঠিয়া উপজেলা",
          "বাঘা উপজেলা","গোদাগাড়ী উপজেলা","তানোর উপজেলা","বাগমারা উপজেলা",
       
        ]},
        {pdname:"নাটোর",
        pupazilas:[
          "নাটোর সদর","সিংড়া","বড়াইগ্রাম","বাগাতিপাড়া","লালপুর",
          "গুরুদাসপুর","নলডাঙ্গা",
        ]},
        {pdname:"জয়পুরহাট",
        pupazilas:[
          "আক্কেলপুর উপজেলা","কালাই উপজেলা","ক্ষেতলাল উপজেলা","পাঁচবিবি উপজেলা","জয়পুরহাট সদর",
          
        ]},
        {pdname:"চাঁপাইনবাবগঞ্জ",
        pupazilas:[
          "চাঁপাইনবাবগঞ্জ সদর","গোমস্তাপুর","নাচোল","ভোলাহাট","শিবগঞ্জ",
         
         
        ]},
        {pdname:"নওগাঁ",
        pupazilas:[
          "মহাদেবপুর উপজেলা","বদলগাছী উপজেলা","পত্নিতলা উপজেলা","ধামইরহাট উপজেলা","নিয়ামতপুর উপজেলা",
          "মান্দা উপজেলা","আত্রাই উপজেলা","রাণীনগর উপজেলা","নওগাঁ সদর","পোরশা উপজেলা",
          "সাপাহার",
        ]},
        
      ]
    },
    {
      pname: "খুলনা",
      pdistricts: [
        {
        pdname:"যশোর",
        pupazilas:[
        "মণিরামপুর","অভয়নগর","বাঘারপাড়া","চৌগাছা","ঝিকরগাছা",
        "কেশবপুর","যশোর সদর","শার্শা",
        ]},
        {pdname:"সাতক্ষীরা",
        pupazilas:[
          "আশাশুনি","দেবহাটা","কলারোয়া","সাতক্ষীরা সদর","শ্যামনগর",
          "তালা","কালিগঞ্জ",
        ]}, 
        {pdname:"মেহেরপুর", 
        pupazilas:[
          "মুজিবনগর","মেহেরপুর সদর","গাংনী",
        ]},
        {pdname:"নড়াইল",
        pupazilas:[
          "নড়াইল সদর","লোহাগড়া","কালিয়া",
       
        ]},
        {pdname:"চুয়াডাঙ্গা",
        pupazilas:[
          "চুয়াডাঙ্গা সদর","আলমডাঙ্গা","দামুড়হুদা","জীবননগর",
        ]},
        {pdname:"কুষ্টিয়া",
        pupazilas:[
          "কুষ্টিয়া সদর","কুমারখালী","খোকসা","মিরপুর","দৌলতপুর",
        "ভেড়ামারা",
        ]},
        {pdname:"মাগুরা",
        pupazilas:[
          "শালিখা","শ্রীপুর","মাগুরা সদর","মহম্মদপুর",
         
        ]},
        {pdname:"খুলনা",
        pupazilas:[
          "পাইকগাছা","ফুলতলা উপজেলা","দিঘলিয়া উপজেলা","রূপসা উপজেলা","তেরখাদা উপজেলা",
        "ডুমুরিয়া উপজেলা","বটিয়াঘাটা","দাকোপ উপজেলা","কয়রা উপজেলা",
        ]},
        {pdname:"বাগেরহাট",
        pupazilas:[
          "ফকিরহাট","বাগেরহাট সদর","মোল্লাহাট","শরণখোলা","রামপাল",
        "মোড়েলগঞ্জ","কচুয়া","মোংলা","চিতলমারী",
        ]},
        {pdname:"ঝিনাইদহ",
        pupazilas:[
          "ঝিনাইদহ সদর","শৈলকুপা","হরিণাকুন্ডু","কালীগঞ্জ","কোটচাঁদপুর",
        "মহেশপুর",
        ]},
        
      ]
    },
    {
      pname: "বরিশাল",
      pdistricts: [
        {
        pdname:"ঝালকাঠি",
        pupazilas:[
        "ঝালকাঠি সদর","কাঠালিয়া","নলছিটি","রাজাপুর",
        ]},
        {pdname:"পটুয়াখালী",
        pupazilas:[
          "বাউফল","পটুয়াখালী সদর","দুমকি","দশমিনা","কলাপাড়া",
        "মির্জাগঞ্জ","গলাচিপা","রাঙ্গাবালী",
        ]}, 
        {pdname:"পিরোজপুর", 
        pupazilas:[
          "পিরোজপুর সদর","নাজিরপুর","কাউখালী","ভান্ডারিয়া","মঠবাড়ীয়া",
        "নেছারাবাদ","ইন্দুরকানী",
        ]},
        {pdname:"বরিশাল",
        pupazilas:[
          "বরিশাল সদর","বাকেরগঞ্জ","বাবুগঞ্জ","উজিরপুর","বানারীপাড়া",
          "গৌরনদী","আগৈলঝাড়া","মেহেন্দিগঞ্জ","মুলাদী","হিজলা",
          
       
        ]},
        {pdname:"ভোলা",
        pupazilas:[
          "ভোলা সদর","বোরহান উদ্দিন","চরফ্যাশন","দৌলতখান","মনপুরা",
          "তজুমদ্দিন","লালমোহন",
        ]},
        {pdname:"বরগুনা",
        pupazilas:[
          "আমতলী","বরগুনা সদর","বেতাগী উপজেলা","বামনা","পাথরঘাটা",
          "তালতলি",
        ]},
        
      ]
    },
    {
      pname: "সিলেট",
      pdistricts: [
        {
        pdname:"সিলেট",
        pupazilas:[
        "বালাগঞ্জ","বিয়ানীবাজার","বিশ্বনাথ","কোম্পানীগঞ্জ","ফেঞ্চুগঞ্জ",
        "গোলাপগঞ্জ","গোয়াইনঘাট","জৈন্তাপুর","কানাইঘাট","সিলেট সদর",
        "জকিগঞ্জ"," দক্ষিণ সুরমা","ওসমানী"
        ]},
        {pdname:"মৌলভীবাজার",
        pupazilas:[
          "বড়লেখা","কমলগঞ্জ","কুলাউড়া","মৌলভীবাজার সদর","রাজনগর",
          "শ্রীমঙ্গল","জুড়ী"
        ]}, 
        {pdname:"হবিগঞ্জ", 
        pupazilas:[
          "নবীগঞ্জ","বাহুবল","আজমিরীগঞ্জ","বানিয়াচং","লাখাই",
          "চুনারুঘাট","হবিগঞ্জ সদর","মাধবপুর উপজেলা","শায়েস্তাগঞ্জ"
        ]},
        {pdname:"সুনামগঞ্জ",
        pupazilas:[
          "সুনামগঞ্জ সদর","দক্ষিণ সুনামগঞ্জ","বিশ্বম্ভরপুর","ছাতক","জগন্নাথপুর",
          "দোয়ারাবাজার","তাহিরপুর","ধর্মপাশা","জামালগঞ্জ","শাল্লা",
          "দিরাই"
        ]}]
    },
    {
      pname: "ঢাকা",
      pdistricts: [
        {
        pdname:"নরসিংদী",
        pupazilas:[
        "বেলাবো","মনোহরদী","নরসিংদী","পলাশ","রায়পুরা",
        "শিবপুর",
        ]},
        {pdname:"গাজীপুর",
        pupazilas:[
          "কালীগঞ্জ","কালিয়াকৈর","কাপাসিয়া","গাজীপুর সদর","শ্রীপুর",
         
        ]}, 
        {pdname:"শরীয়তপুর", 
        pupazilas:[
          "শরিয়তপুর সদর","নড়িয়া","জাজিরা","গোসাইরহাট","ভেদরগঞ্জ",
        "ডামুড্যা",
        ]},
        {pdname:"নারায়ণগঞ্জ",
        pupazilas:[
          "আড়াইহাজার উপজেলা","বন্দর উপজেলা","নারায়নগঞ্জ সদর","রূপগঞ্জ উপজেলা"," সোনারগাঁ উপজেলা", "ফতুল্লা"
        
        ]},
        {pdname:"টাঙ্গাইল",
        pupazilas:[
          "বাসাইল","ভুয়াপুর","দেলদুয়ার","ঘাটাইল","গোপালপুর",
        "মধুপুর","মির্জাপুর","নাগরপুর","সখিপুর"," টাঙ্গাইল সদর",
        "কালিহাতী","ধনবাড়ী",
        ]},
        {pdname:"কিশোরগঞ্জ",
        pupazilas:[
          "ইটনা","কটিয়াদী","ভৈরব","তাড়াইল","হোসেনপুর",
        "পাকুন্দিয়া","কুলিয়ারচর","কিশোরগঞ্জ সদর","করিমগঞ্জ","বাজিতপুর",
        "অষ্টগ্রাম","মিঠামইন","নিকলী",
        ]},
        {pdname:"মানিকগঞ্জ",
        pupazilas:[
          "হরিরামপুর","সাটুরিয়া","মানিকগঞ্জ সদর","ঘিওর","শিবালয়",
        "দৌলতপুর","সিংগাইর",
         
        ]},
        {pdname:"ঢাকা",
        pupazilas:[
          "সাভার","ধামরাই","কেরাণীগঞ্জ","নবাবগঞ্জ","দোহার",
       
        ]},
        {pdname:"মুন্সিগঞ্জ",
        pupazilas:[
          "মুন্সিগঞ্জ সদর","শ্রীনগর","সিরাজদিখান","লৌহজং","গজারিয়া",
        "টংগীবাড়ি",
        ]},
        {pdname:"রাজবাড়ী",
        pupazilas:[
          "রাজবাড়ী সদর","গোয়ালন্দ","পাংশা","বালিয়াকান্দি","কালুখালী",
      
        ]},
        {pdname:"মাদারীপুর",
        pupazilas:[
          "মাদারীপুর সদর","শিবচর","কালকিনি","রাজৈর",
        ]},
        {pdname:"গোপালগঞ্জ",
        pupazilas:[
          "গোপালগঞ্জ সদর","কাশিয়ানী","টুংগীপাড়া","কোটালীপাড়া","মুকসুদপুর",
        
        ]},
        {pdname:"ফরিদপুর",
        pupazilas:[
          "ফরিদপুর সদর","আলফাডাঙ্গা","বোয়ালমারী","সদরপুর","নগরকান্দা",
        "ভাঙ্গা","চরভদ্রাসন","মধুখালী","সালথা",
        ]},
      ]
    },
    {
      pname: "রংপুর ",
      pdistricts: [
        {
        pdname:"পঞ্চগড়",
        pupazilas:[
        "পঞ্চগড়","দেবীগঞ্জ","বোদা","আটোয়ারী","তেতুলিয়া",
       
        ]},
        {pdname:"দিনাজপুর",
        pupazilas:[
          "নবাবগঞ্জ","বীরগঞ্জ উপজেলা","ঘোড়াঘাট","বিরামপুর","পার্বতীপুর উপজেলা",
        "বোচাগঞ্জ উপজেলা","কাহারোল উপজেলা","ফুলবাড়ী উপজেলা","দিনাজপুর সদর",
        "হাকিমপুর উপজেলা",
        "খানসামা","বিরল উপজেলা","চিরিরবন্দর উপজেলা",
        ]}, 
        {pdname:"লালমনিরহাট", 
        pupazilas:[
          "লালমনিরহাট সদর","কালীগঞ্জ","হাতীবান্ধা","পাটগ্রাম","আদিতমারী উপজেলা",
        
        ]},
        {pdname:"নীলফামারী",
        pupazilas:[
          "সৈয়দপুর উপজেলা","ডোমার উপজেলা","ডিমলা","জলঢাকা","কিশোরগঞ্জ",
        "নীলফামারী সদর",
       
        ]},
        {pdname:"গাইবান্ধা",
        pupazilas:[
          "সাদুল্লাপুর","গাইবান্ধা সদর","পলাশবাড়ী","সাঘাটা উপজেলা","গোবিন্দগঞ্জ উপজেলা",
        "সুন্দরগঞ্জ","ফুলছড়ি",
        ]},
        {pdname:"ঠাকুরগাঁও",
        pupazilas:[
          "ঠাকুরগাঁও সদর","পীরগঞ্জ উপজেলা","রাণীশংকৈল উপজেলা","হরিপুর উপজেলা","বালিয়াডাঙ্গী উপজেলা",
          
        ]},
        {pdname:"রংপুর",
        pupazilas:[
          "রংপুর সদর","গংগাচড়া","তারাগঞ্জ উপজেলা","বদরগঞ্জ উপজেলা","মিঠাপুকুর উপজেলা",
          "পীরগঞ্জ উপজেলা","কাউনিয়া উপজেলা"," পীরগাছা উপজেলা",
         
        ]},
        {pdname:"কুড়িগ্রাম",
        pupazilas:[
          "কুড়িগ্রাম সদর","নাগেশ্বরী","ভুরুঙ্গামারী","ফুলবাড়ী","রাজারহাট",
        "উলিপুর","চিলমারী","রৌমারী","চর রাজিবপুর",
        ]},
        
      ]
    },
    {
      pname: "ময়মনসিংহ ",
      pdistricts: [
        {
        pdname:"শেরপুর",
        pupazilas:[
        "শেরপুর সদর","নালিতাবাড়ী উপজেলা","শ্রীবরদী উপজেলা","নকলা উপজেলা","ঝিনাইগাতী উপজেলা",
        
        ]},
        {pdname:"ময়মনসিংহ",
        pupazilas:[
          "ফুলবাড়ীয়া","ত্রিশাল","ভালুকা","মুক্তাগাছা","ময়মনসিংহ সদর",
        "ধোবাউড়া","ফুলপুর","হালুয়াঘাট","গৌরীপুর","গফরগাঁও",
        "ঈশ্বরগঞ্জ","নান্দাইল","তারাকান্দা",
        ]}, 
        {pdname:"জামালপুর", 
        pupazilas:[
          "জামালপুর সদর","মেলান্দহ","ইসলামপুর","দেওয়ানগঞ্জ","সরিষাবাড়ী",
          "মাদারগঞ্জ","বকশীগঞ্জ",
        ]},
        {pdname:"নেত্রকোণা",
        pupazilas:[
          "বারহাট্টা","দুর্গাপুর","কেন্দুয়া","আটপাড়া","মদন",
        "খালিয়াজুরী","কলমাকান্দা","মোহনগঞ্জ","পূর্বধলা"," নেত্রকোণা সদর",
       
        ]},
        
      ]
    },
  ];

export const pdistricts = [
  "কুমিল্লা", "ফেনী", "ব্রাহ্মণবাড়িয়া",
  "রাঙ্গামাটি", "নোয়াখালী", "চাঁদপুর",
  "লক্ষ্মীপুর", "চট্টগ্রাম", "কক্সবাজার",
  "খাগড়াছড়ি", "বান্দরবান","সিরাজগঞ্জ", "পাবনা", "বগুড়া", "রাজশাহী",
  "নাটোর", "জয়পুরহাট", "চাঁপাইনবাবগঞ্জ", "নওগাঁ","যশোর", "সাতক্ষীরা", "মেহেরপুর", "নড়াইল",
  "চুয়াডাঙ্গা", "কুষ্টিয়া", "মাগুরা", "খুলনা",
  "বাগেরহাট", "ঝিনাইদহ","ঝালকাঠি", "পটুয়াখালী", "পিরোজপুর", "বরিশাল",
  "ভোলা", "বরগুনা","সিলেট", "মৌলভীবাজার", "হবিগঞ্জ", "সুনামগঞ্জ","নরসিংদী", "গাজীপুর", "শরীয়তপুর", "নারায়ণগঞ্জ",
  "টাঙ্গাইল", "কিশোরগঞ্জ", "মানিকগঞ্জ", "ঢাকা",
  "মুন্সিগঞ্জ", "রাজবাড়ী", "মাদারীপুর", "গোপালগঞ্জ",
  "ফরিদপুর","পঞ্চগড়", "দিনাজপুর", "লালমনিরহাট", "নীলফামারী",
  "গাইবান্ধা", "ঠাকুরগাঁও", "রংপুর", "কুড়িগ্রাম","শেরপুর", "ময়মনসিংহ", "জামালপুর", "নেত্রকোণা",
  ];
export const pdivisions = [
  "চট্টগ্রাম", "রাজশাহী", "খুলনা", "বরিশাল", "সিলেট", "ঢাকা", "রংপুর","ময়মনসিংহ"
  ];

 export const cdivisionsData = [
  {
    cname: "চট্টগ্রাম",
    cdistricts: [
      {
      cdname:"কুমিল্লা",
      cupazilas:[
      "দেবিদ্বার","বরুড়া","ব্রাহ্মণপাড়া","চান্দিনা","চৌদ্দগ্রাম",
      "দাউদকান্দি","হোমনা","লাকসাম","মুরাদনগর","নাঙ্গলকোট",
      "কুমিল্লা সদর","মেঘনা","মনোহরগঞ্জ","সদর দক্ষিণ","তিতাস","বুড়িচং","লালমাই",
      ]},
      {cdname:"ফেনী",
      cupazilas:[
        "ছাগলনাইয়া উপজেলা","ফেনী সদর","সোনাগাজী উপজেলা","ফুলগাজী উপজেলা","পরশুরাম",
        "দাগনভূঞা",
      ]}, 
      {cdname:"ব্রাহ্মণবাড়িয়া	", 
      cupazilas:[
        "ব্রাহ্মণবাড়িয়া সদর","কসবা","নাসিরনগর","সরাইল উপজেলা","আশুগঞ্জ",
        "আখাউড়া","নবীনগর","বাঞ্ছারামপুর","বিজয়নগর",
      ]},
      {cdname:"রাঙ্গামাটি	",
      cupazilas:[
        "রাঙ্গামাটি সদর","কাপ্তাই","কাউখালী","বাঘাইছড়ি","বরকল",
      "লংগদু","রাজস্থলী","বিলাইছড়ি","জুরাছড়ি","নানিয়ারচর",
     
      ]},
      {cdname:"নোয়াখালী",
      cupazilas:[
        "নোয়াখালী","কোম্পানীগঞ্জ","বেগমগঞ্জ","হাতিয়া","সুবর্ণচর",
      "কবিরহাট","সেনবাগ","চাটখিল","সোনাইমুড়ী",
      ]},
      {cdname:"চাঁদপুর",
      cupazilas:[
        "হাইমচর","কচুয়া","শাহরাস্তি","চাঁদপুর সদর","মতলব উত্তর",
        "হাজীগঞ্জ","মতলব দক্ষিণ","ফরিদগঞ্জ",
      ]},
      {cdname:"লক্ষ্মীপুর",
      cupazilas:[
        "লক্ষ্মীপুর সদর","কমলনগর","রায়পুর","রামগতি","রামগঞ্জ",
       
      ]},
      {cdname:"চট্টগ্রাম",
      cupazilas:[
        "রাঙ্গুনিয়া","সীতাকুন্ড উপজেলা","মীরসরাই","পটিয়া","সন্দ্বীপ",
      "বাঁশখালী","বোয়ালখালী","আনোয়ারা","চন্দনাইশ","সাতকানিয়া",
      "লোহাগাড়া","হাটহাজারী","ফটিকছড়ি","রাউজান","কর্ণফুলী",
      ]},
      {cdname:"কক্সবাজার",
      cupazilas:[
        "কক্সবাজার সদর","চকরিয়া","কুতুবদিয়া","উখিয়া","মহেশখালী",
        "পেকুয়া","রামু","টেকনাফ",
      ]},
      {cdname:"খাগড়াছড়ি",
      cupazilas:[
        "খাগড়াছড়ি সদর","দিঘীনালা","পানছড়ি","লক্ষীছড়ি","মহালছড়ি",
        "মানিকছড়ি","রামগড়","মাটিরাঙ্গা","গুইমারা",
      ]},
      {cdname:"বান্দরবান",
      cupazilas:[
        "বান্দরবান সদর","আলীকদম","নাইক্ষ্যংছড়ি","রোয়াংছড়ি","লামা",
        "রুমা","থানচি",
      ]},
    ]
  },
  {
    cname: "রাজশাহী",
    cdistricts: [
      {
      cdname:"সিরাজগঞ্জ",
      cupazilas:[
      "বেলকুচি","চৌহালি","কামারখন্দ","কাজীপুর","রায়গঞ্জ",
      "শাহজাদপুর","সিরাজগঞ্জ","তাড়াশ","উল্লাপাড়া",
      ]},
      {cdname:"পাবনা",
      cupazilas:[
        "সুজানগর","ঈশ্বরদী","ভাঙ্গুড়া","পাবনা সদর","বেড়া",
        "আটঘরিয়া","চাটমোহর","সাঁথিয়া","ফরিদপুর",
      ]}, 
      {cdname:"বগুড়া", 
      cupazilas:[
        "কাহালু উপজেলা","বগুড়া সদর","সারিয়াকান্দি","শাজাহানপুর","দুপচাচিঁয়া উপজেলা",
        "আদমদিঘি উপজেলা","নন্দিগ্রাম","সোনাতলা উপজেলা","ধুনট উপজেলা","গাবতলী",
        "শেরপুর উপজেলা","শিবগঞ্জ",
      ]},
      {cdname:"রাজশাহী",
      cupazilas:[
        "পবা উপজেলা","দুর্গাপুর উপজেলা","মোহনপুর উপজেলা","চারঘাট উপজেলা","পুঠিয়া উপজেলা",
        "বাঘা উপজেলা","গোদাগাড়ী উপজেলা","তানোর উপজেলা","বাগমারা উপজেলা",
     
      ]},
      {cdname:"নাটোর",
      cupazilas:[
        "নাটোর সদর","সিংড়া","বড়াইগ্রাম","বাগাতিপাড়া","লালপুর",
        "গুরুদাসপুর","নলডাঙ্গা",
      ]},
      {cdname:"জয়পুরহাট",
      cupazilas:[
        "আক্কেলপুর উপজেলা","কালাই উপজেলা","ক্ষেতলাল উপজেলা","পাঁচবিবি উপজেলা","জয়পুরহাট সদর",
        
      ]},
      {cdname:"চাঁপাইনবাবগঞ্জ",
      cupazilas:[
        "চাঁপাইনবাবগঞ্জ সদর","গোমস্তাপুর","নাচোল","ভোলাহাট","শিবগঞ্জ",
       
       
      ]},
      {cdname:"নওগাঁ",
      cupazilas:[
        "মহাদেবপুর উপজেলা","বদলগাছী উপজেলা","পত্নিতলা উপজেলা","ধামইরহাট উপজেলা","নিয়ামতপুর উপজেলা",
        "মান্দা উপজেলা","আত্রাই উপজেলা","রাণীনগর উপজেলা","নওগাঁ সদর","পোরশা উপজেলা",
        "সাপাহার",
      ]},
      
    ]
  },
  {
    cname: "খুলনা",
    cdistricts: [
      {
      cdname:"যশোর",
      cupazilas:[
      "মণিরামপুর","অভয়নগর","বাঘারপাড়া","চৌগাছা","ঝিকরগাছা",
      "কেশবপুর","যশোর সদর","শার্শা",
      ]},
      {cdname:"সাতক্ষীরা",
      cupazilas:[
        "আশাশুনি","দেবহাটা","কলারোয়া","সাতক্ষীরা সদর","শ্যামনগর",
        "তালা","কালিগঞ্জ",
      ]}, 
      {cdname:"মেহেরপুর", 
      cupazilas:[
        "মুজিবনগর","মেহেরপুর সদর","গাংনী",
      ]},
      {cdname:"নড়াইল",
      cupazilas:[
        "নড়াইল সদর","লোহাগড়া","কালিয়া",
     
      ]},
      {cdname:"চুয়াডাঙ্গা",
      cupazilas:[
        "চুয়াডাঙ্গা সদর","আলমডাঙ্গা","দামুড়হুদা","জীবননগর",
      ]},
      {cdname:"কুষ্টিয়া",
      cupazilas:[
        "কুষ্টিয়া সদর","কুমারখালী","খোকসা","মিরপুর","দৌলতপুর",
      "ভেড়ামারা",
      ]},
      {cdname:"মাগুরা",
      cupazilas:[
        "শালিখা","শ্রীপুর","মাগুরা সদর","মহম্মদপুর",
       
      ]},
      {cdname:"খুলনা",
      cupazilas:[
        "পাইকগাছা","ফুলতলা উপজেলা","দিঘলিয়া উপজেলা","রূপসা উপজেলা","তেরখাদা উপজেলা",
      "ডুমুরিয়া উপজেলা","বটিয়াঘাটা","দাকোপ উপজেলা","কয়রা উপজেলা",
      ]},
      {cdname:"বাগেরহাট",
      cupazilas:[
        "ফকিরহাট","বাগেরহাট সদর","মোল্লাহাট","শরণখোলা","রামপাল",
      "মোড়েলগঞ্জ","কচুয়া","মোংলা","চিতলমারী",
      ]},
      {cdname:"ঝিনাইদহ",
      cupazilas:[
        "ঝিনাইদহ সদর","শৈলকুপা","হরিণাকুন্ডু","কালীগঞ্জ","কোটচাঁদপুর",
      "মহেশপুর",
      ]},
      
    ]
  },
  {
    cname: "বরিশাল",
    cdistricts: [
      {
      cdname:"ঝালকাঠি",
      cupazilas:[
      "ঝালকাঠি সদর","কাঠালিয়া","নলছিটি","রাজাপুর",
      ]},
      {cdname:"পটুয়াখালী",
      cupazilas:[
        "বাউফল","পটুয়াখালী সদর","দুমকি","দশমিনা","কলাপাড়া",
      "মির্জাগঞ্জ","গলাচিপা","রাঙ্গাবালী",
      ]}, 
      {cdname:"পিরোজপুর", 
      cupazilas:[
        "পিরোজপুর সদর","নাজিরপুর","কাউখালী","ভান্ডারিয়া","মঠবাড়ীয়া",
      "নেছারাবাদ","ইন্দুরকানী",
      ]},
      {cdname:"বরিশাল",
      cupazilas:[
        "বরিশাল সদর","বাকেরগঞ্জ","বাবুগঞ্জ","উজিরপুর","বানারীপাড়া",
        "গৌরনদী","আগৈলঝাড়া","মেহেন্দিগঞ্জ","মুলাদী","হিজলা",
        
     
      ]},
      {cdname:"ভোলা",
      cupazilas:[
        "ভোলা সদর","বোরহান উদ্দিন","চরফ্যাশন","দৌলতখান","মনপুরা",
        "তজুমদ্দিন","লালমোহন",
      ]},
      {cdname:"বরগুনা",
      cupazilas:[
        "আমতলী","বরগুনা সদর","বেতাগী উপজেলা","বামনা","পাথরঘাটা",
        "তালতলি",
      ]},
      
    ]
  },
  {
    cname: "সিলেট",
    cdistricts: [
      {
      cdname:"সিলেট",
      cupazilas:[
      "বালাগঞ্জ","বিয়ানীবাজার","বিশ্বনাথ","কোম্পানীগঞ্জ","ফেঞ্চুগঞ্জ",
      "গোলাপগঞ্জ","গোয়াইনঘাট","জৈন্তাপুর","কানাইঘাট","সিলেট সদর",
      "জকিগঞ্জ"," দক্ষিণ সুরমা","ওসমানী"
      ]},
      {cdname:"মৌলভীবাজার",
      cupazilas:[
        "বড়লেখা","কমলগঞ্জ","কুলাউড়া","মৌলভীবাজার সদর","রাজনগর",
        "শ্রীমঙ্গল","জুড়ী"
      ]}, 
      {cdname:"হবিগঞ্জ", 
      cupazilas:[
        "নবীগঞ্জ","বাহুবল","আজমিরীগঞ্জ","বানিয়াচং","লাখাই",
        "চুনারুঘাট","হবিগঞ্জ সদর","মাধবপুর উপজেলা","শায়েস্তাগঞ্জ"
      ]},
      {cdname:"সুনামগঞ্জ",
      cupazilas:[
        "সুনামগঞ্জ সদর","দক্ষিণ সুনামগঞ্জ","বিশ্বম্ভরপুর","ছাতক","জগন্নাথপুর",
        "দোয়ারাবাজার","তাহিরপুর","ধর্মপাশা","জামালগঞ্জ","শাল্লা",
        "দিরাই"
      ]}]
  },
  {
    cname: "ঢাকা",
    cdistricts: [
      {
      cdname:"নরসিংদী",
      cupazilas:[
      "বেলাবো","মনোহরদী","নরসিংদী","পলাশ","রায়পুরা",
      "শিবপুর",
      ]},
      {cdname:"গাজীপুর",
      cupazilas:[
        "কালীগঞ্জ","কালিয়াকৈর","কাপাসিয়া","গাজীপুর সদর","শ্রীপুর",
       
      ]}, 
      {cdname:"শরীয়তপুর", 
      cupazilas:[
        "শরিয়তপুর সদর","নড়িয়া","জাজিরা","গোসাইরহাট","ভেদরগঞ্জ",
      "ডামুড্যা",
      ]},
      {cdname:"নারায়ণগঞ্জ",
      cupazilas:[
        "আড়াইহাজার উপজেলা","বন্দর উপজেলা","নারায়নগঞ্জ সদর","রূপগঞ্জ উপজেলা"," সোনারগাঁ উপজেলা", "ফতুল্লা"
      
      ]},
      {cdname:"টাঙ্গাইল",
      cupazilas:[
        "বাসাইল","ভুয়াপুর","দেলদুয়ার","ঘাটাইল","গোপালপুর",
      "মধুপুর","মির্জাপুর","নাগরপুর","সখিপুর"," টাঙ্গাইল সদর",
      "কালিহাতী","ধনবাড়ী",
      ]},
      {cdname:"কিশোরগঞ্জ",
      cupazilas:[
        "ইটনা","কটিয়াদী","ভৈরব","তাড়াইল","হোসেনপুর",
      "পাকুন্দিয়া","কুলিয়ারচর","কিশোরগঞ্জ সদর","করিমগঞ্জ","বাজিতপুর",
      "অষ্টগ্রাম","মিঠামইন","নিকলী",
      ]},
      {cdname:"মানিকগঞ্জ",
      cupazilas:[
        "হরিরামপুর","সাটুরিয়া","মানিকগঞ্জ সদর","ঘিওর","শিবালয়",
      "দৌলতপুর","সিংগাইর",
       
      ]},
      {cdname:"ঢাকা",
      cupazilas:[
        "সাভার","ধামরাই","কেরাণীগঞ্জ","নবাবগঞ্জ","দোহার",
     
      ]},
      {cdname:"মুন্সিগঞ্জ",
      cupazilas:[
        "মুন্সিগঞ্জ সদর","শ্রীনগর","সিরাজদিখান","লৌহজং","গজারিয়া",
      "টংগীবাড়ি",
      ]},
      {cdname:"রাজবাড়ী",
      cupazilas:[
        "রাজবাড়ী সদর","গোয়ালন্দ","পাংশা","বালিয়াকান্দি","কালুখালী",
    
      ]},
      {cdname:"মাদারীপুর",
      cupazilas:[
        "মাদারীপুর সদর","শিবচর","কালকিনি","রাজৈর",
      ]},
      {cdname:"গোপালগঞ্জ",
      cupazilas:[
        "গোপালগঞ্জ সদর","কাশিয়ানী","টুংগীপাড়া","কোটালীপাড়া","মুকসুদপুর",
      
      ]},
      {cdname:"ফরিদপুর",
      cupazilas:[
        "ফরিদপুর সদর","আলফাডাঙ্গা","বোয়ালমারী","সদরপুর","নগরকান্দা",
      "ভাঙ্গা","চরভদ্রাসন","মধুখালী","সালথা",
      ]},
    ]
  },
  {
    cname: "রংপুর ",
    cdistricts: [
      {
      cdname:"পঞ্চগড়",
      cupazilas:[
      "পঞ্চগড়","দেবীগঞ্জ","বোদা","আটোয়ারী","তেতুলিয়া",
     
      ]},
      {cdname:"দিনাজপুর",
      cupazilas:[
        "নবাবগঞ্জ","বীরগঞ্জ উপজেলা","ঘোড়াঘাট","বিরামপুর","পার্বতীপুর উপজেলা",
      "বোচাগঞ্জ উপজেলা","কাহারোল উপজেলা","ফুলবাড়ী উপজেলা","দিনাজপুর সদর",
      "হাকিমপুর উপজেলা",
      "খানসামা","বিরল উপজেলা","চিরিরবন্দর উপজেলা",
      ]}, 
      {cdname:"লালমনিরহাট", 
      cupazilas:[
        "লালমনিরহাট সদর","কালীগঞ্জ","হাতীবান্ধা","পাটগ্রাম","আদিতমারী উপজেলা",
      
      ]},
      {cdname:"নীলফামারী",
      cupazilas:[
        "সৈয়দপুর উপজেলা","ডোমার উপজেলা","ডিমলা","জলঢাকা","কিশোরগঞ্জ",
      "নীলফামারী সদর",
     
      ]},
      {cdname:"গাইবান্ধা",
      cupazilas:[
        "সাদুল্লাপুর","গাইবান্ধা সদর","পলাশবাড়ী","সাঘাটা উপজেলা","গোবিন্দগঞ্জ উপজেলা",
      "সুন্দরগঞ্জ","ফুলছড়ি",
      ]},
      {cdname:"ঠাকুরগাঁও",
      cupazilas:[
        "ঠাকুরগাঁও সদর","পীরগঞ্জ উপজেলা","রাণীশংকৈল উপজেলা","হরিপুর উপজেলা","বালিয়াডাঙ্গী উপজেলা",
        
      ]},
      {cdname:"রংপুর",
      cupazilas:[
        "রংপুর সদর","গংগাচড়া","তারাগঞ্জ উপজেলা","বদরগঞ্জ উপজেলা","মিঠাপুকুর উপজেলা",
        "পীরগঞ্জ উপজেলা","কাউনিয়া উপজেলা"," পীরগাছা উপজেলা",
       
      ]},
      {cdname:"কুড়িগ্রাম",
      cupazilas:[
        "কুড়িগ্রাম সদর","নাগেশ্বরী","ভুরুঙ্গামারী","ফুলবাড়ী","রাজারহাট",
      "উলিপুর","চিলমারী","রৌমারী","চর রাজিবপুর",
      ]},
      
    ]
  },
  {
    cname: "ময়মনসিংহ ",
    cdistricts: [
      {
      cdname:"শেরপুর",
      cupazilas:[
      "শেরপুর সদর","নালিতাবাড়ী উপজেলা","শ্রীবরদী উপজেলা","নকলা উপজেলা","ঝিনাইগাতী উপজেলা",
      
      ]},
      {cdname:"ময়মনসিংহ",
      cupazilas:[
        "ফুলবাড়ীয়া","ত্রিশাল","ভালুকা","মুক্তাগাছা","ময়মনসিংহ সদর",
      "ধোবাউড়া","ফুলপুর","হালুয়াঘাট","গৌরীপুর","গফরগাঁও",
      "ঈশ্বরগঞ্জ","নান্দাইল","তারাকান্দা",
      ]}, 
      {cdname:"জামালপুর", 
      cupazilas:[
        "জামালপুর সদর","মেলান্দহ","ইসলামপুর","দেওয়ানগঞ্জ","সরিষাবাড়ী",
        "মাদারগঞ্জ","বকশীগঞ্জ",
      ]},
      {cdname:"নেত্রকোণা",
      cupazilas:[
        "বারহাট্টা","দুর্গাপুর","কেন্দুয়া","আটপাড়া","মদন",
      "খালিয়াজুরী","কলমাকান্দা","মোহনগঞ্জ","পূর্বধলা"," নেত্রকোণা সদর",
     
      ]},
      
    ]
  },
  ];

  export default pdivisionsData